# Parameters
nc: 10 # number of classes: person, cat, dog, bottle, banana, orange, chair, laptop, book, backpack
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n' 
# scale are used to define the model architecture when training the model


#[depth, width, max_channels]
#depth defines the scaling factor for the number of repeated modules and layers in the model
#width defines the scaling factor for the number of channels in the model
#max_channels defines the maximum number of channels in the model, if the number of channels is larger than max_channels, then we will use the max_channels

  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs 
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
# backbone is the first part of the model, which is used to extract the features of the image
backbone:

  #[from, repeats, module, args]
  #from defines where the layer is from, -1 means the previous layer
  #repeats defines how many times the layer is repeated, more repeats can capture more features
  #module defines the type of the layer,'Conv', 'C3k2', 'SPPF', 'C2PSA' means the block type
  #args defines the arguments of the layer

  #[filters, kernel_size, stride]
  #filters defines the number of output channels of the layer
  #kernel_size defines the size of the kernel in the layer
  #stride defines the stride of the layer

  #the output of the layer is the input of the next layer
  #13 means this is the 13th layer of the model

  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2 
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # False means the layer is not using the residual connection
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
# head is the second part of the model, which is used to make the final prediction
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # for example, the first layer is the upsampling layer using nearest neighbor interpolation, which can be used to increase the spatial dimensions of the feature map
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4: 'cat' is concatenate, P4 is the scale-specific feature map
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
